{"story": ["Taylor went fishing with his father.", "They got up very early to go to the lake.", "They sat quietly all day long.", "Finally, they caught a fish!.", "It was too small and they had to toss it back."], "cause_idx": [3], "res_idx": 4}
{"story": ["Charlie went to food truck event at the beach.", "He said they had a ton of trucks there.", "He tried food from a few trucks.", "He said the food was great.", "I am going to try to go next year."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sandra went strawberry picking with her mother.", "They spent several hours in the sun gathering berries.", "At the end of the day sandra dropped her bushel of strawberries!.", "Luckily she was able to scoop them all up again.", "Sandra was glad that her hard work hadn't been wasted!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lewy wanted to build a snowman.", "He went outside and started rolling snow.", "Soon he had a snowman.", "Lewy found some green paint.", "Soon he had a green snowman."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Nell was new in school and wanted to make friends.", "Nell told the class that her parents ran a candy store.", "On the playground, kids flocked around nell.", "They asked nell to bring them some candy.", "Nell snuck into the store and grabbed candy for her friends."], "cause_idx": [3], "res_idx": 4}
{"story": ["Today was sarah's birthday!.", "She had a big party with all of her family and friends.", "She had lots of presents.", "Her cake had pink and purple flowers on it.", "Sarah had a great birthday."], "cause_idx": [0, 1], "res_idx": 4}
{"story": ["Sally's mother woke her up for school.", "Sally told her that she did not feel very well.", "Her mother checked her temperature.", "Her temperature showed she had a fever.", "So her mother took her to the doctor for medicine."], "cause_idx": [3], "res_idx": 4}
{"story": ["My friend told me about a new bar in town.", "We drove around trying to find it and saw it was packed.", "We parked and went inside the bar.", "My friend saw a handsome man who she liked.", "The man walked up to my friend and gave her his number."], "cause_idx": [3], "res_idx": 4}
{"story": ["Kim was excited about her new shows.", "She decided to wear them out as soon as she could.", "Unfortunately it had rained recently.", "Kim accidentally stepped into a muddy puddle.", "It ruined her new shoes."], "cause_idx": [3], "res_idx": 4}
{"story": ["Today timmy jumped and played in the mud.", "The mud got all over his clothes.", "He went inside his home and his mom said he needed a bath.", "Timmy got in the tub and his mom bathed him.", "Timmy was finally clean."], "cause_idx": [3], "res_idx": 4}
{"story": ["I woke up feeling very sick.", "I had a fever, aches, and a runny nose.", "I went to the doctor to find out what was wrong.", "My doctor told me that i had the flu.", "I slept a lot for three days until i finally felt better."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Jill's tomatoes kept disappearing off the plant on her deck.", "There'd be one ready to be picked the next day.", "But when she'd get up in the morning, it would be gone.", "One day she got up extra early.", "When she looked outside there was a fat squirrel eating her tomatoes."], "cause_idx": [], "res_idx": 4}
{"story": ["Jim gained weight after eating poorly.", "He tried to put a belt on but it would not fit.", "He took out a hole punch and punched new holes in his belt.", "Jim put on the new belt for a test fit.", "He was pleased with how the bigger belt fit."], "cause_idx": [3], "res_idx": 4}
{"story": ["Ed took out his airplane for fun on a cloudy day.", "Some of the clouds started to get dark as he flew.", "Eventually ed got stuck in a thunderstorm.", "He had to land the plane on the road down below.", "Many cars rushed out of the way to make room for his plane."], "cause_idx": [3], "res_idx": 4}
{"story": ["My girlfriend, rita, was sitting on the beach.", "She started getting bored, so she decided to take a swim.", "When she jumped in the ocean, she saw the fin of a shark.", "Rita quickly exited the water, and ran for the parking lot.", "She told me she never wanted to go to that beach again."], "cause_idx": [2], "res_idx": 4}
{"story": ["Ollie does not plan to go to school today.", "When he leaves home after breakfast, he walks towards the bus stop.", "He continues past the bus stop and goes to the arcade.", "As it turns out, the arcade isn't open at 9am.", "Ollie goes to school."], "cause_idx": [3], "res_idx": 4}
{"story": ["It started raining this morning.", "I spent some time making coffee and sitting down.", "Opening the curtains, i saw the pretty rain.", "It rained all morning.", "Now i don't need to water my garden!."], "cause_idx": [3], "res_idx": 4}
{"story": ["We decided to get married on the beach.", "Our family and friends met us there.", "It was a perfectly sunny summer day.", "Best of all, no one had to wear shoes!.", "We ended our day with a dip in the cool ocean."], "cause_idx": [0], "res_idx": 4}
{"story": ["The man filled the pitcher.", "He carried it to the table.", "He dropped the pitcher.", "Some of the beer fell on the ground.", "The man went to get a new pitcher."], "cause_idx": [2], "res_idx": 4}
{"story": ["Yesterday was lauren's birthday.", "Her mother decided to surprise her with her favorite cake.", "Lauren loves lemon cake.", "Lauren's mother even decorated the cake with candles.", "She loved the cake and ate 2 pieces after blowing out the candles."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Tim wanted to start a band.", "Tim wanted to play the guitar.", "Tim practiced for months.", "Tim had gotten really good at guitar.", "Tim successfully started his band!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Steph was in a pumpkin patch.", "She wandered around the patch checking pumpkins.", "She found a few that were okay, but nothing great.", "Suddenly, she saw a perfect pumpkin.", "She put it in a wheelbarrow and brought it to her car."], "cause_idx": [3], "res_idx": 4}
{"story": ["Joe woke up to see that his car was snowed in.", "Joe put on his warm cloths to go outside.", "Joe went outside and got his snow shovel.", "Joe worked for a long time shoveling the snow.", "Joe was proud when he saw he had cleared his car out."], "cause_idx": [3], "res_idx": 4}
{"story": ["Renee has a baby.", "One day, courtney asked to hold the baby.", "Courtney did not know how to hold renee's baby.", "Renee showed her how to hold the baby.", "Courtney was happy to learn how to hold a baby."], "cause_idx": [3], "res_idx": 4}
{"story": ["I wanted to grow fruit in my backyard.", "I decided to grow pears.", "I bought some pear tree seeds and planted them.", "After two years, the pear tree finally developed fruit.", "The pears were delicious!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Timmy wanted to have a big thanksgiving dinner.", "Timmy asked his mom if the family could have a big thanksgiving dinner.", "Timmy's mom agreed that they could have a big thanksgiving dinner.", "Timmy's mom invited all of their friends and family for thanksgiving.", "Timmy and his family had a great thanksgiving together."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Kelly and rob had a date for tonight.", "Rob picked her up at six.", "The two of them had a great time.", "The date went so well, they ended with a kiss.", "Rob and kelly agreed to see each other again."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tina wanted a new phone.", "She begged her parents for one.", "They said no.", "Finally they said yes.", "She got a new one the next day."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sadie was on a skiing trip with her parents.", "She was really having fun for the first part of the day.", "Soon she began to feel bitterly cold.", "She tried to get through it but it was too frustrating.", "Finally, she gave up and decided to stop skiing."], "cause_idx": [3], "res_idx": 4}
{"story": ["Ericka enjoyed going to restaurants, but she liked to save money too.", "She found a coupon for her favorite restaurant.", "She went there for lunch and ordered a burger.", "When the bill came, she was nervous about the coupon.", "The restaurant accepted the coupon and ericka saved a lot of money!."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["Ian decided to grow his own vegetables in his backyard.", "He thought it would save him money.", "But he got tired of watering of them.", "It turned out to be a lot of work.", "Ian felt like a full time farmer."], "cause_idx": [3], "res_idx": 4}
{"story": ["Kyle had decided to teach his cat how to walk on a leash.", "That way he could take it for walks around the city.", "He went to the pet store and bought a leash and collar.", "The cat did not fight him at all when he put the collar on.", "They go for walks twice a day with no problems."], "cause_idx": [3], "res_idx": 4}
{"story": ["Oliver was visiting the dog pound with his family.", "They were looking for a new puppy.", "Then, oliver spotted an older, tired looking dog.", "He was a stray who had been injured.", "Oliver decided that he wanted to give that dog a home."], "cause_idx": [2], "res_idx": 4}
{"story": ["Sarah got into an accident on new year's eve.", "She slid on the highway and hit the car next to her.", "They both slid into the guardrail.", "No one was hurt.", "Both cars were totalled."], "cause_idx": [2], "res_idx": 4}
{"story": ["Cory had his first track meet today.", "Cory had only been on the track team for a few weeks.", "He ran laps every day with his friends.", "He still wasn't sure how his performance would compare.", "Cory did much better than he expected."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Dave had to take a train to his grandma's house.", "This was his first time.", "He kept asking people for help and directions.", "He made everything on time.", "He met up with his grandma."], "cause_idx": [3], "res_idx": 4}
{"story": ["We had my oldest nephew sleep over at our house.", "He packed up all his clothes, and brought some books.", "We went swimming in the pool and then got ice cream.", "After dinner we made a fire and had s'mores.", "It was a great time, i hope we can do it again."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Stephen woke up to a cold morning.", "He walked outside.", "There was ice on the ground.", "A old woman was about to step on the ice.", "Stephen saved her from the fall."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Ann loved to build snowmen.", "She went outside in the snow.", "Than she began to roll it in balls.", "Soon she had a big snowman.", "Ann had the coolest snowman on the block."], "cause_idx": [3], "res_idx": 4}
{"story": ["Nana sings a song to fiona.", "Fiona smiles at nana.", "Fiona claps her hands.", "Fiona dances in circles.", "Fiona sings a song to nana."], "cause_idx": [0], "res_idx": 4}
{"story": ["The man made a date.", "He was excited to go.", "He got ready for the date.", "He went to the meeting spot.", "His date never showed up."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Lucy burned her arm on the oven.", "She tried not to cry, but the burn hurt a lot.", "Her grandma sprayed a burn spray on the burn.", "Lucy put a band-aid on the burn and went to watch tv.", "After 10 minutes the burn no longer hurt."], "cause_idx": [2], "res_idx": 4}
{"story": ["I went to a baseball game.", "There was a loud fan in front of me.", "He yelled at every pitch for three innings.", "The crowd then yelled at him.", "He was very quiet for the rest of the game."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["I was in plays my entire young adult life.", "I wanted to become a big star.", "I practiced acting all the time.", "I was great on stage.", "But i never won any awards and gave up my dreams."], "cause_idx": [1], "res_idx": 4}
{"story": ["It was finally time to leave for the beach.", "I packed up all of my things and put my flip-flops on.", "It was a short walk to the beach.", "I took my flip-flops off and started walking on the sand.", "The feeling of sand between my toes was great."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Nell had always wanted to go to spain.", "As soon as she could afford it she booked her ticket to madrid.", "She stayed in madrid for a few days before heading out to explore.", "Her explorations led her to walk the camino de santiago.", "Two months later she flew back to the united states a happy woman."], "cause_idx": [1], "res_idx": 4}
{"story": ["Rachel was studying to become baptized.", "She was nearing the end of her lessons.", "Her teacher asked her if she was sure that she wanted to do it.", "Rachel thought about it.", "She had a change of heart and decided not to go through with it."], "cause_idx": [2], "res_idx": 4}
{"story": ["Thalia has been invited to play at her friend janice's home.", "When thalia arrives there, she is excited to see a trampoline.", "Thalia and janice spend the whole afternoon on the trampoline.", "Thalia has so much fun that she asks her father if they can get one.", "Thalia would love to have a trampoline just like janice has."], "cause_idx": [2], "res_idx": 4}
{"story": ["Ashley hated dragon flys a lot.", "In fact, she hated anything that was small and flew.", "One day, ashley was forced to go outside.", "Then, ashley suddenly saw a dragonfly.", "At first, she was scared but then, she fought her fears and won."], "cause_idx": [3], "res_idx": 4}
{"story": ["Rob took his son fishing.", "The went out in the boat in the pond.", "Rob helped his son cast his line.", "The little boy threw out the line and felt a tug.", "He caught a five pound catfish!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Joe didn't have a costume for this halloween party.", "Joe went to a costume store to find one.", "He found a very nice costume.", "He bought it and took it home to put it on.", "He went to the party with his costume."], "cause_idx": [0], "res_idx": 4}
{"story": ["I have to do most of the cleaning at my house.", "One thing i do is clean the floors.", "I sweep the floors with a broom.", "Then, i mop the floors with hot water and soap.", "Finally, i wait for the floors to dry."], "cause_idx": [3], "res_idx": 4}
{"story": ["The horse showed up to our house.", "It was brown and white.", "No one knew where it came from.", "She was broken and let us ride here.", "We adopted her and named her claire."], "cause_idx": [0], "res_idx": 4}
{"story": ["Bob hated mowing.", "Mowing was his least favorite activity.", "His wife however, loved to have a perfect yard.", "So every saturday bob would wake up and mow the yard.", "Bob mowed every saturday to prove his love for his wife."], "cause_idx": [2], "res_idx": 4}
{"story": ["Linda had always loved the xylophone.", "Since she was very little, she loved the instrument.", "Once linda was 10 years old, she started learning it.", "After a lot of hard work, she could play it.", "Now, linda is one of the best players in the nation."], "cause_idx": [3], "res_idx": 4}
{"story": ["Gina was on a side street getting on the main street.", "But the streets were icy, and the side street was a hill.", "Gina's car was having a hard time getting up the hill.", "She realized she would need to back up to get up the hill.", "Just then a van pulled up behind her and she was unable to back up."], "cause_idx": [3], "res_idx": 4}
{"story": ["I went to the beach yesterday.", "It took forever to get there.", "We had to use the gps.", "But the gps was not working.", "We got stuck."], "cause_idx": [0, 1], "res_idx": 4}
{"story": ["Mindy was scared of roaches.", "She thought they would one day take over the world.", "One day she got out of bed for a glass of water.", "She saw a roach on the floor.", "Mindy nearly fainted."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["John decided he wanted to move to a new state.", "Before he could move he needed to sell his house.", "A buyer offered john a good price for his house.", "John sold the house.", "He was happy that he could now move to a new state."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Ed wanted to go for a boat ride.", "He went down to the marina.", "There, he asked a captain to give him a ride.", "The captain agreed.", "Ed had a great time on his boat ride!."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Jake was invited to a friend's house for a party.", "He never really liked the friend.", "He knew it was his parent's house.", "He decided to throw up in one of the closets.", "Nobody ever found out it was him."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Louisa got her kids a new puppy.", "She surprised them on christmas morning.", "The puppy came out of the garage with a bow on it's neck.", "The boys played with the puppy.", "Then, they named it."], "cause_idx": [0], "res_idx": 4}
{"story": ["Dan was digging in his yard to put in an extension to his home.", "He wasn't very deep when his shovel thudded against something hard.", "Suddenly a black stream spewed up into the air!.", "Dan thought he'd struck oil!.", "When he sniffed the air he realized he'd struck a sewage pipe."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["It was the day of the big football game.", "Tim went to school ready to win.", "After a hard fought game, tim's team won.", "However, tim's clothes were all dirty.", "Fortunately, his mother bought him a change of clothes."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Sandra went strawberry picking with her mother.", "They spent several hours in the sun gathering berries.", "At the end of the day sandra dropped her bushel of strawberries!.", "Luckily she was able to scoop them all up again.", "Sandra was glad that her hard work hadn't been wasted!."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Richard was never sick usually.", "One day, richard got a horrible flu.", "He was in bed for 5 days, nauseous and ill.", "He thought he might never get better.", "But by the 6th day he started to feel better, and returned to school."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["Edward was in the middle of his birthday celebration.", "It was time for the cake to come out.", "He loved hearing his friends and family sing for him.", "When it was time, edward blew all the candles out.", "It only took one blow to do so."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Sally had a birthday coming up.", "She was excited about her party and gifts.", "When she got to her party there was a table full of gifts.", "She could not wait to open the biggest one.", "It in was the most perfect purse and she was so happy."], "cause_idx": [0], "res_idx": 4}
{"story": ["Gina wanted to go in the woods.", "His mother told him not to.", "Gina did it anyways.", "Night fell and she was lost.", "So, a wolf started to chase her."], "cause_idx": [0], "res_idx": 4}
{"story": ["I was watching the llws and the red sox tonight.", "Both were exciting games.", "The score was tied in both games.", "But i was tired and fell asleep.", "I got up in time to watch the end of the llws game."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Lewy wanted a puppy.", "He asked his mom and dad for one.", "They he would have to wait.", "One morning lewy woke up some wet on his face.", "There it was on his bed his very own puppy."], "cause_idx": [0, 1], "res_idx": 4}
{"story": ["When i was in high school i use to watch south park.", "My parents didn't know what this show was about.", "This show was very politically incorrect.", "At first, my parents didn't like south park.", "Eventually my parents end up liking it."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sam went door to door to try to sell magazines.", "He knocked on one door and waited.", "An old man opened the door and greeted sam.", "Sam took out his flyers and began to sell to the man.", "The old man waved sam off and told him to go."], "cause_idx": [3], "res_idx": 4}
{"story": ["The pool was open yesterday, to mia's excitement.", "Mia wanted to go swimming.", "She asked a friend to go with her.", "Mia and her friend went to the pool to enjoy the water.", "They swam until the pool closed, and went home exhausted."], "cause_idx": [0], "res_idx": 4}
{"story": ["Last friday was my sister's birthday.", "She really wanted a cake so i baked her one.", "I asked my friend to take it to my sister's house with me.", "On the way there, my friend dropped the cake on the car floor.", "We stopped at the store to buy a new one and my sister was happy."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Jim's cat would not stop meowing.", "His cat was keeping him up all night.", "Jim decided to play with his cat.", "He also gave his cat some catnip.", "After a few minutes, his cat got tired and fell asleep."], "cause_idx": [2], "res_idx": 4}
{"story": ["Rufus has always wanted to try to skateboard.", "He saved up his allowance until he had almost enough money for one.", "His father gave him the extra money he needed.", "He took his new skateboard to the local park to try it out.", "Rufus was so happy to finally be riding a skateboard."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Sam had a crush on katy.", "Sam was too shy to talk to her.", "One day he decided to ask her out.", "She said that she would love to go out!.", "Sam and katy have been dating ever since."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Marion was about to move.", "She was cleaning her house up before the move.", "She opened up a closet that had been closed for a year.", "Inside was a bag with some sort of goo on it.", "She decided to just leave it."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["When i was younger, my dad played guitar to put me to sleep.", "As i grew older, i really wanted to learn how to play the guitar.", "I begged for a guitar, but dad wouldn't let me play with his.", "Instead, i looked at beginner guitars online.", "Later, my dad drove me to the music store so i could buy a guitar."], "cause_idx": [2], "res_idx": 4}
{"story": ["Cindy got a new phone.", "But when she brought it to school, she left it in her backpack.", "When she got home, she couldn't find her phone.", "Cindy's parents got her a new phone.", "And cindy always kept the phone in her pocket."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lisa's daughter was three.", "They had been shopping and running errands all day.", "The child was thirsty so lisa bought her a drink.", "Lisa's daughter spilled the drink in the car.", "Lisa stopped allowing her daughter to drink in the car."], "cause_idx": [0], "res_idx": 4}
{"story": ["Sam was afraid of his mean, old neighbor, mrs june.", "Sam asked his mother why mrs june was so mean.", "His mother explained that mrs june wasn't mean, just lonely.", "Sam thought about it, and decided to be friendlier to mrs june.", "It turned out she wasn't so scary after all!."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Todd liked pizza for dinner.", "He asked his mom if he could have it for today.", "She said yes but he had to make it.", "Todd made his first pizza that day.", "He was the only one to have pizza that night."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tom got a new grill.", "He bought steak to cook.", "Tom invited friends over to eat.", "When they cut into the steak they were still bloody.", "Tom just threw the steaks back on the grill."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Todd wanted a pet fish.", "He told his mom he wanted a fish.", "His mom told him he had to wait.", "It was todd's birthday.", "His mom got him a big fish."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Sam was trying to light a fire on a camping trip.", "It was extremely windy, though.", "Every time he lit a match, it would go out.", "He had to hold his hand in front of it to stop this from happening.", "It took an hour, but he finally managed to get a fire going."], "cause_idx": [3], "res_idx": 4}
{"story": ["Micah was at work.", "His bike was chained up out back.", "When he went to ride his bike home, it was gone.", "He checked the tapes and saw that it had been stolen.", "He was never able to find it."], "cause_idx": [2], "res_idx": 4}
{"story": ["Fred wanted to take sally on a fun date.", "He decided to take them ice skating.", "Fred and sally had a lot of fun!.", "Fred asked sally to be his girlfriend during the date.", "Since she had so much fun, sally said yes."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Sam can't sleep at night.", "He is afraid of the monsters under the bed.", "Dad tells him there is no such thing as monsters but it doesn't help.", "So dad gives him a blanket and tells him that it's a magic blanket.", "Sam believes that he is protected by the blanket and he sleeps well."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Sandra was walking to the store.", "She passed a little girl who was crying on her front steps.", "Sandra asked her what was wrong.", "The little girl said she was locked out of her house.", "Sandra sat down and waited with her for her parents to come home."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Cindy wanted to go to the store and buy a lollipop.", "Cindy had no money to buy it.", "Cindy took money from her dad's change jar to buy the lollipop.", "Her dad found out cindy took the money.", "Cindy's dad made cindy return the lollipop to the store."], "cause_idx": [2], "res_idx": 4}
{"story": ["Jane loved cooking.", "Everyone else in her family did too.", "Her grandmother was teaching her family recipes.", "Jane was a quick learner.", "Eventually she learned everything there was to teach."], "cause_idx": [2], "res_idx": 4}
{"story": ["We had my oldest nephew sleep over at our house.", "He packed up all his clothes, and brought some books.", "We went swimming in the pool and then got ice cream.", "After dinner we made a fire and had s'mores.", "It was a great time, i hope we can do it again."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["My son fell asleep for his afternoon nap.", "I tiptoed through the house so that i wouldn't wake him.", "The doorbell rang.", "I opened the door, but nobody was there.", "I closed the door and my son woke up."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Fred wanted to start a joke shop.", "He did not have money.", "Luckily his friend, harry, gave him some money.", "Fred opened the shop as soon as he could.", "Many people were very excited."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Tim had a bag of chips.", "He kept it to himself.", "Lee wanted some.", "Tim thought about it.", "Tim decided to share so that everyone was happy."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Andrea and sara had just left a candy store.", "They were eating chocolate lollipops.", "Suddenly, sara tripped and dropped her candy.", "It had fallen into the dirt.", "Sara was so sad, so she went and bought a new one."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["A group of us play chess at work.", "One night we visited the boylston chess club.", "They play speed chess on tuesday nights.", "We won a few games and lost a lot.", "It was a fun trip but we never went back."], "cause_idx": [1], "res_idx": 4}
{"story": ["Betty was five year's old and loved to go to restaurants.", "Every weekend she would beg her mother to take her out to eat.", "One weekend, her mother took her to a mexican restaurant.", "Betty ordered something that was too spicy for her.", "For many weeks after, betty did not ask to go out to eat."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Chris wanted to visit the zoo.", "Chris told his friend how he had never been to the zoo before.", "They both went together.", "Chris loved looking at the animals.", "Chris had a great time at the zoo with his friend."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Sadie wnted to have a big thanksgiving dinner.as on a skiing trip with her parents.", "She was really having fun for the first part of the day.", "Soon she began to feel bitterly cold.", "She tried to get through it but it was too frustrating.", "Finally, she gave up and decided to stop skiing."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Tommy was a well-liked kid.", "He did well in school.", "Tommy was the teacher's pet.", "One day tommy said a bad word in class.", "The teacher could not believe it and sent tommy home."], "cause_idx": [3], "res_idx": 4}
{"story": ["Janet went to a farm with her class.", "They were all having fun looking at the animals.", "Janet walked over to a lamb.", "She was given a snack to give the lamb and enjoyed feeding it.", "The rest of the day janet stayed by the lambs side."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sarah wanted a new shirt for the game.", "She did not have quite enough money.", "She decided to pick up some babysitting jobs.", "Sarah finally saved up.", "She was able to buy the shirt she wanted."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["Kelly was really excited.", "She was finally getting her birkin bag today.", "She was on the waiting list for two year's and now she was getting it.", "Kelly ran to the store to pick it up.", "It was perfect."], "cause_idx": [3], "res_idx": 4}
{"story": ["My dog ate a whole plate of bacon by himself.", "He got a bad stomachache.", "We had to feed him some medicine.", "Once the medicine worked, he looked like he felt much better.", "He still ate bacon whenever he could find it."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["A little boy named timmy sure did love his sweets.", "His mother gave him a lollipop every afternoon.", "He looked forward to his daily lollipop all morning long.", "One saturday, his mother took timmy to the candy store.", "Timmy picked out a lollipop that was bigger than his own head!."], "cause_idx": [3], "res_idx": 4}
{"story": ["The town meeting hall has a dance party every other wednesday.", "Jenny and james like dancing with each other in the party.", "They already danced together for two months.", "Last wednesday james didn't go the party.", "Jenny didn't want to go either but didn't want james to miss her."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Joy and grace plan to meet for breakfast.", "Joy invites grace to place by her house.", "They both meet up at the little diner.", "Over they spoke about their families.", "After breakfast they hugged each other and said goodbye."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["I decided to try to bake a jelly roll for the holidays.", "I used flour, sugar, and followed the recipe.", "I filled the dough with jelly and cream.", "I baked them for 30 minutes.", "I ate 3 jelly rolls because they were so delicious."], "cause_idx": [0], "res_idx": 4}
{"story": ["The orange fell from the tree.", "It hit a girl on the head.", "The girl looked up at the tree.", "Another orange fell from the tree.", "That orange broke her nose."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Timmy was told many times not to play ball in the house.", "Today he didn't listen and played with his basketball inside.", "The ball hit his mom's favorite vase.", "His mom found out and wanted to know who broke it.", "Since no one would admit it, the family vacation was cancelled."], "cause_idx": [2], "res_idx": 4}
{"story": ["Abdul wanted to fly an airplane.", "Abdul studied for many years to become a pilot.", "After much hard work, abdul finally became a pilot!.", "Abdul was hired by a big airline company.", "Because of his hard work, abdul now flies every day."], "cause_idx": [], "res_idx": 4}
{"story": ["Tony was getting ready for a date.", "He was getting dressed.", "Tony put on clothes that didn't match.", "He picked up his date.", "Tony's date laughed at his clothes."], "cause_idx": [2], "res_idx": 4}
{"story": ["Today i saw a woman with a baby.", "She was helping the baby eat lunch.", "I was thinking about what it would be like to be feeding a baby.", "I decided that i wanted a baby someday.", "I decided to find a wife so i could start a family."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sarah was giving her cat a bath.", "Her cat squirmed as she put him in the bathtub.", "All of a sudden, her cat jumped out of the bathtub.", "Her cat scratched sarah's arm on his way down.", "Sarah had to bandage her arm in order to stop the bleeding."], "cause_idx": [2], "res_idx": 4}
{"story": ["Jim went out to the bar with his friends tuesday night.", "He drank seven beers and three shots in two hours.", "He immediately felt sick after getting home and removing his shoes.", "Making his way to the bathroom, he jammed his foot into the wall.", "He broke two toes and had to use crutches for a month."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["We all went to a haunted house last halloween.", "A creepy clown jumped out at my friend gary.", "Gary was so scared he screamed.", "We all think gary wet himself.", "Gary ran home to change his pants."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["I went to a children's birthday party.", "First, i had some cake.", "Next, i played with some of the kids.", "After, i gave the birthday boy his present.", "Lastly, i went home."], "cause_idx": [2], "res_idx": 4}
{"story": ["My friend has a hat.", "The wind blew his hat away.", "My friend chased his hat.", "I chased his hat with him.", "We caught my friends hat."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Hunter, a one year old dog loves to catch things in his mouth.", "One day his human family took him to the river.", "His male owner threw a rock at the water.", "However, hunter grabbed in his mouth and it broke his canine tooth.", "Hunter had a surgery to remove the broken tooth and he recovered fast."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["The man filled the pitcher.", "He carried it to the table.", "He dropped the pitcher.", "Some of the beer fell on the ground.", "The man went to get a new pitcher."], "cause_idx": [2], "res_idx": 4}
{"story": ["Kevin took his kids to ride go karts.", "They all raced around the track many times.", "It was great fun!.", "The kids decided they would like to race another time.", "It was their new favorite hobby!."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["Megan was waiting at the bus stop to go to school.", "It was raining and she was wearing her boots and raincoat.", "Suddenly, a car sped by and went through a puddle.", "The water splashed so high and even soaked megan on the sidewalk.", "The bus showed up and she had to go to school all wet."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Denise loved playing pokemon go.", "She decided to take a walk so she could play.", "While she was crossing the street, denise saw a pokemon on her screen.", "Denise was almost hit by a car as she walked into traffic.", "She decided to only play on the sidewalk from now on."], "cause_idx": [3], "res_idx": 4}
{"story": ["Two boxers were fighting in the ring on fight night.", "The less experienced fighter had trouble landing punches.", "During the 3rd round, the less experienced fighter was knocked down.", "After getting back up, the boxer began learning from his mistakes.", "By the end of the night, the less experienced boxer won the fight."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Annie took a trip to florida to see her dad.", "They visited magic kingdom but annie didn't have much fun.", "Her dad walked so fast that she couldn't keep up with him.", "He wouldn't slow down because he thought he had to see everything.", "Annie just wanted to see her dad."], "cause_idx": [0], "res_idx": 4}
{"story": ["I was sitting with my friends eating lunch when i got stung by a bee.", "The bee came and stung me and i screamed.", "I ran to the nurse to get some ice.", "I could see the black stinger inside me.", "I immediately started being afraid of bees since."], "cause_idx": [3], "res_idx": 4}
{"story": ["Miranda was hungry from some chili.", "She loved chili but had never made it herself.", "She followed a recipe.", "She added extra spices because she loved hot food.", "She had to throw the chili out because it was way too spicy."], "cause_idx": [3], "res_idx": 4}
{"story": ["The boy was playing with a new toy.", "It was a yoyo!.", "He practiced throwing it down and having it come back up.", "The yoyo got away from him and hit him in the face.", "This was harder than he had thought!."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Jake was wearing a bandana while doing yardwork.", "He put the bandana over his mouth to keep out the dust.", "He then pretended that he was a bandit in the old west.", "Jake rode his rake around the yard like it was a horse.", "He had so much fun he forgot to clean the yard after that."], "cause_idx": [1], "res_idx": 4}
{"story": ["Sean was invited to a christmas party.", "He carefully planned out what he would wear to the party.", "When the day of the party arrived sean was both happy and excited.", "Sean had a great time at the party and met many new friends.", "He can't wait until next year's party."], "cause_idx": [2], "res_idx": 4}
{"story": ["Timmy wanted to have a big thanksgiving dinner.", "Timmy asked his mom if the family could have a big thanksgiving dinner.", "Timmy's mom agreed that they could have a big thanksgiving dinner.", "Timmy's mom invited all of their friends and family for thanksgiving.", "Timmy and his family had a great thanksgiving together."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["I was sitting in my living room.", "My dog started to bark.", "I looked over and saw he was barking at a cockroach.", "I picked up a heavy book and smashed the cockroach.", "It died and my dog stopped barking."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Joe was bored.", "Joe wanted to go out.", "Joe call his friends to go out.", "Joe and his friends went out downtown.", "Joe had a lot of fun with his friends."], "cause_idx": [3], "res_idx": 4}
{"story": ["Bob invited his friends over to use his new grill.", "Bob and his friends started to cook.", "Everyone was having a good time.", "Bob was going to put a big steak on.", "Bob tripped and dropped the steak right on jim!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tim and jim began to play cards.", "They kept score on the first few games.", "After the fourth game they forgot to count points.", "They decided that the score was not that important.", "Thereafter they just played for fun."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Sarah loved to watch the birds in her yard.", "One day, she saw a beautiful bird in her yard.", "The bird had a friend and they kept flying around each other.", "Sarah was really excited because she knew they were in love.", "Later that year, sarah saw a nest full of eggs next to the two birds!."], "cause_idx": [0], "res_idx": 4}
{"story": ["Jim took a long road trip.", "He stopped at a restaurant in the middle of nowhere.", "When jim got back into his car, he realized the battery died.", "He tried and tried to start the car.", "With his last try, he was able to get the car started again."], "cause_idx": [1], "res_idx": 4}
{"story": ["Kelley wanted a cat.", "But she didn't think her parents would let her.", "Finally they said no.", "They got her two cats.", "Kelley named them fred and george."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sally's cat, sam, loved playing with string.", "One day sam got all caught up in some string while he was playing.", "He ended up getting so tied up that he could not get free.", "Sally had to cut the string to get him untangled.", "Afterwards sam did not want to play with string anymore."], "cause_idx": [3], "res_idx": 4}
{"story": ["The baker children went running in the woods.", "They climbed over rocks and fallen branches.", "Elizabeth fell in a hole.", "The hole was full of bees.", "Elizabeth was stung hundreds of times."], "cause_idx": [1, 2], "res_idx": 4}
{"story": ["Andrea was on a walk with her friend.", "It was nighttime and they were outside.", "She asked her friend to hold her phone and tossed it to her.", "Later, when she asked for it back, her friend didn't have it.", "Andrea had accidentally dropped the phone on the ground."], "cause_idx": [2], "res_idx": 4}
{"story": ["My friend told me about a new bar in town.", "We drove around trying to find it and saw it was packed.", "We parked and went inside the bar.", "My friend saw a handsome man who she liked.", "The man walked up to my friend and gave her his number."], "cause_idx": [3], "res_idx": 4}
{"story": ["Beth was eating her lunch at work outside.", "She was talking to her friend when a bird landed on her chair.", "Beth let out a little shout and the bird flew off.", "Her friend laughed and wanted to know why she shouted.", "Beth was just shocked the bird would come so close."], "cause_idx": [1], "res_idx": 4}
{"story": ["I made plans for dinner with my girlfriend.", "She agreed to go to dinner with me.", "We were on our way to a nice restaurant.", "She got a phone call from work.", "We had to cancel dinner so she could go into work,."], "cause_idx": [3], "res_idx": 4}
{"story": ["The mailman came to my door to deliver some letters.", "I came out to meet him as he did this.", "I asked the mailman if he could deliver something for me.", "The mailman said he could if it had stamps on it.", "I handed the mailman a frying pan with 20 stamps on it."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Riley is bullied at school.", "She wants to fight back.", "She gets hit.", "She fights back.", "Riley gets beat up in her fight."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Jesse liked to write.", "He had a hard time coming up with stories though.", "He decided to make five sentence stories.", "He now has a much easier time coming up with stories.", "He now gets paid to write them."], "cause_idx": [2], "res_idx": 4}
{"story": ["Michael kept a pet rock and took it on walks every day.", "He would pretend to have adventures with it on the walk.", "His neighbors found the adventures entertaining to watch.", "Some of them would even walk with him with their own pet rocks.", "One day a neighbor even gave him a second rock!."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Tom asked a group of his friends to go to the movies.", "Everyone arrived at the movie theater and chose a movie.", "After buying tickets, they all bought some popcorn and pop.", "Tom and his friends sat in the front row to watch the movie.", "After the movie was over, they all went home."], "cause_idx": [], "res_idx": 4}
{"story": ["Matthew's front yard had a single tree in it.", "He decided to make his son a swing.", "His grandpa did the same for him when he was that age.", "He threw a rope over a branch and tied an old tire to it.", "His son swung for hours just like he did when he was a kid."], "cause_idx": [3], "res_idx": 4}
{"story": ["Mr jerry was going to fix chesters bike.", "He told chester he'll deliver it to him.", "Chester got a call from mr jerry.", "Apparently, mr jerry messed it up even worse.", "Mr jerry promised to buy him a new bike though."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["A woman found a pony.", "The pony looked sad.", "The woman thought of something to help.", "She gave the pony some fresh hay.", "The pony cheered up and was happy."], "cause_idx": [3], "res_idx": 4}
{"story": ["John had a test coming up in three days.", "So john was ready to study for his test.", "He needed to pass it in order pass the class.", "John studied for those three days.", "John took the test and passed it."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Lucy bought a brand new outfit for school.", "The next morning she proudly dressed in her new clothes.", "Lucy walked to school carefully through the slushy snow.", "As she climbed the school stairs she slipped and fell.", "Lucy cried when she saw mud covering her new pants."], "cause_idx": [3], "res_idx": 4}
{"story": ["I got tired of having eggs and potatoes for breakfast every day.", "So i got some pancake mix to make pancakes.", "I combines the mix, an egg, some milk, and a bit of oil.", "I mixed all those up really well, but not too much.", "And this morning i made three really fantastic pancakes."], "cause_idx": [2], "res_idx": 4}
{"story": ["The plane trip was so scary.", "As we went up i felt my heart pumping heard.", "As the ride went on it felt smoother.", "I ended up falling asleep.", "When the ride was over i woke up."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Tom bought a new pair of boots and set them by the back door.", "Janie walked in, eating a chocolate ice cream cone.", "Mom yells out, telling janie not to be eating before dinner.", "Janie drops the ice cream into one of tom's new boots.", "Tom pours the melted ice cream on janie's head."], "cause_idx": [2], "res_idx": 4}
{"story": ["Lee and craig each wanted to watch a different show on the television.", "The argued over whose show would be seen first.", "Lee suggested they flip a coin.", "The coin toss won craig first dibs on the television.", "They happily watched craig's show."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Jeff decided that his son needed a kitten to grow up with.", "When he was at the store one day he saw some kittens being given away.", "He just knew the little orange one would be perfect for his son!.", "He brought the kitten home, cleaned it up, and gave it to his son.", "His son loved the kitten, like jeff knew he would!."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Alex was on a gameshow.", "He was so excited he kept forgetting to buzz in.", "Even though he knew the answers, he fell very behind.", "At the end of the show, he was in last place.", "He felt ashamed, having embarrassed himself like that."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Susie was feeling lonely in class.", "She saw other kids playing and longed to join them.", "She asked them if she could play alongside them.", "They rudely told her no.", "Susie went home feeling even lonelier than before."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Martha loved to bake cookies.", "She made a batch of chocolate chip cookie dough.", "She rolled the dough into balls and put them in to bake.", "After twenty minutes, the scent of cookies filled the house.", "The cookies were perfectly baked!."], "cause_idx": [2], "res_idx": 4}
{"story": ["The man played his guitar.", "He found something he liked.", "He wrote it down.", "He built off of it.", "He wrote a pretty good song."], "cause_idx": [0], "res_idx": 4}
{"story": ["Sam was standing on a bridge over a stream.", "He picked up a rock and threw it in.", "The rock made a small splash.", "Sam looked for a bigger rock to throw in.", "He found a very large rock but he was too weak to lift it."], "cause_idx": [1], "res_idx": 4}
{"story": ["Oliver was visiting the dog pound with his family.", "They were looking for a new puppy.", "Then, oliver spotted an older, tired looking dog.", "He was a stray who had been injured.", "Oliver decided that he wanted to give that dog a home."], "cause_idx": [2], "res_idx": 4}
{"story": ["Whitney has a dog.", "Her dog snores.", "The snoring sounds like a human.", "It shakes the bed.", "It rattles the room."], "cause_idx": [1], "res_idx": 4}
{"story": ["Missy and two of her friends went on a girls weekend.", "They went out to lunch and went shopping.", "They came back to the hotel and got ready.", "They went out to a club and danced.", "It was a very fun weekend."], "cause_idx": [3], "res_idx": 4}
{"story": ["Gina went to the store and got ice cream for herself.", "When she got home her mom was mad she didn't get some for everyone.", "She handed gina some money and sent her back to the store.", "Gina bought a gallon of ice cream and ran back home.", "She was afraid it would melt in the heat if she walked."], "cause_idx": [3], "res_idx": 4}
{"story": ["Randy was fishing at a lake.", "He enjoyed being outdoors.", "But he felt impatient when no fish were biting.", "Suddenly, he felt something bite his fishing rod.", "It was so heavy that randy couldn't wait to see it."], "cause_idx": [3], "res_idx": 4}
{"story": ["Ty was scared of bees!.", "One night a bee got into her room.", "She yelled and ran out quickly.", "She made her dad go in and get rid of the bee.", "Only then would i go back in her room."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tom bought four things of ice cream.", "One was mint, one was orange, and one was brownie fudge.", "He got stuck in traffic on the way home from the store.", "The ice cream got melty and sort of made a mess.", "When he got home, he froze what was left of it."], "cause_idx": [1, 2, 3], "res_idx": 4}
{"story": ["Florence went to library one afternoon.", "As she was reading she over hears her name.", "Florence looks around frantically.", "She hears her name again.", "There happened to be another florence in the library."], "cause_idx": [2], "res_idx": 4}
{"story": ["One day i came across a tea house.", "I had never been to a tea house, so i decide to see what it was like.", "When i stepped through the doorway i couldn't believe my eyes!.", "There were so many types of tea i wanted to try them all.", "I bought a pot of tea and ever since then i have gone back every day."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Tom and jim had a huge tree in their backyard.", "They loved climbing it.", "But their parents never knew about it.", "One day, jim fell off the tree and broke his arm.", "They were not allowed to climb the tree anymore."], "cause_idx": [3], "res_idx": 4}
{"story": ["Fran worked at a restaurant.", "She lost an earring while making dessert.", "She could not find it anywhere.", "A customer found fran's earring in her dessert.", "Fran apologized, but she got fired anyway."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Dave wanted to dunk on his basketball hoop.", "He got his ladder out and lowered the hoop.", "Dave hopped off the ladder and got a ball.", "He took a running start and jumped with the ball.", "Dave dunked so hard the hoop fell off."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Amy was watching tv when she found a scary movie.", "She and her brother watched the whole film.", "They each pretend not to be afraid.", "When it was time to sleep amy was scared to go into her room.", "She fell asleep hiding under her bed with a flashlight."], "cause_idx": [1], "res_idx": 4}
{"story": ["I decided to go to the beach today.", "I wanted to get some sun.", "I packed my sunscreen, bathing suit, and towel.", "I got into my car and drove to the beach.", "After staying for 2 hours, i drove home."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lisa saw a new kid at school.", "She thought he was dressed a bit odd.", "But she remembered what her parents told her about being nice.", "So she decided to be nice to him.", "They weren't friends yet but at the very least friendly."], "cause_idx": [3], "res_idx": 4}
{"story": ["Chris wanted to make his girlfriend a cake.", "He decided on red velvet since that was her favorite.", "He put all of his love into the cake.", "He even wrote a small message with icing.", "She loved the cake that chris made for her."], "cause_idx": [3], "res_idx": 4}
{"story": ["A dog owner gave his dog a bone.", "The dog took the bone to the back yard.", "The dog dug a small hole with his front paws.", "The dog placed the bone in the hole.", "The dog covered the bone with dirt."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["When jeff spoke to his friends, he pretended to know everything.", "He said that he knew how to build a canoe with his bare hands.", "His friends told him if he could do it they would pay him $1000.", "Jeff was shocked at such a challenge.", "The friends took this as a sign that he was lying."], "cause_idx": [3], "res_idx": 4}
{"story": ["My kitchen was filling up with trash.", "I picked up a bag to carry it to my trash can.", "I began to walk down my driveway with the bag.", "Suddenly, the bag ripped and trash fell everywhere.", "I cleaned up the spilled trash and put it in the trash can."], "cause_idx": [3], "res_idx": 4}
{"story": ["Wes invited doug to his grandfather's lake house.", "Doug loved to swim.", "Doug accepted the invitation to the lake house.", "Wes and doug were attacked by horseflies when they swam.", "They spent the rest of the time inside the late house watching tv."], "cause_idx": [3], "res_idx": 4}
{"story": ["Leo is walking home.", "He sees a dog stuck in a tree.", "He frees the dog from the tree.", "The dog runs off.", "Leo saved the dog's life."], "cause_idx": [3], "res_idx": 4}
{"story": ["Shawn ran out of dog food.", "His dog was hungry.", "Shawn went to the store.", "Bought dog food.", "Went home to fed his dog."], "cause_idx": [3], "res_idx": 4}
{"story": ["Arnold was scared of insects.", "He was in class one day at his school.", "He saw a tiny ant on his desk.", "He jumped off his desk so hard he fell down.", "His classmates laughed at him."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Ian wanted a pool.", "But he didn't know how to swim.", "So he decided to practice swimming at his friend's house.", "But he swam there so often that he didn't need his own pool.", "Ian was glad that he learned how to swim though."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Mel took his son fishing on the weekends.", "He loved the one on one time he spent with his son.", "When mel's son got older, his son son moved away.", "Mel would see his son several times during the year.", "They would always make time to go fishing."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Today i climbed a tree.", "I grabbed the lowest branch.", "I tried to pull myself up.", "I had a lot of trouble getting up in the tree.", "I made it onto the first branch."], "cause_idx": [3], "res_idx": 4}
{"story": ["Kerry wanted to get a new puppy.", "Kerry's mom said no.", "She asked her dad.", "Kerry's dad said yes.", "Kerry got a new puppy!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Shelly went shell hunting on the beach today.", "She looked for the prettiest shells she could find.", "But most of the shells were broken.", "Then, suddenly, a beautiful cone shell caught her eye.", "Shelly came home happily with her new find."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Yesterday i ate a bug.", "I had never eaten a bug before, but yesterday was different.", "I poured a bowl of cereal and took a big bite.", "Then i noticed the bugs running around in my bowl.", "I must admit that bugs are quite tasty in breakfast cereal."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["The other day i saw a snake out on the lawn.", "I went inside to get a broom.", "I couldn't find a broom so i found a large stick.", "I shooed the snake away with the large stick.", "I haven't seen the snake since."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Matt was scared.", "He had been challenged to a fight after school.", "He did not want to be known as a coward, so he showed up.", "He was afraid, though, that he would get beat up.", "But to his surprise, his opponent never even showed up!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Paul was carrying his dishes to the sink.", "He tripped up the steps.", "Paul dropped his plate.", "The plate broke.", "Paul had a huge mess to clean up."], "cause_idx": [2], "res_idx": 4}
{"story": ["Dan bounced in the bouncy castle.", "All the kids and adults looked at him funnily.", "Dan didn't care.", "He bounced and bounced and bounced.", "Dan only stopped when they called the cops and made him leave."], "cause_idx": [2], "res_idx": 4}
{"story": ["Larry tried out for the baseball team.", "He was so happy when he made it!.", "But his first practice, he swung too hard.", "His bat snapped in half.", "Larry's dad had to buy him a new one."], "cause_idx": [3], "res_idx": 4}
{"story": ["Ron wanted to get some fresh produce.", "He was tired of just peppers and tomatoes at the grocery store.", "As he was driving along, he saw a farmer's market.", "He went in and bought some vegetables he had never had before.", "Spaghetti squash turned out to be the best discovery he had ever had!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sally liked to yo-yo.", "She was very good at it.", "She was doing it one day when it happened.", "The yo-yo broke off its string and flew across the room.", "It hit her pet cat which now stays far away from sally."], "cause_idx": [0, 1], "res_idx": 4}
{"story": ["I went on space mountain ride yesterday.", "When i sat in the car i was getting scared.", "We took off and my stomach dropped.", "We went so fast i wanted it to be over.", "Thankfully the next minute it was over."], "cause_idx": [3], "res_idx": 4}
{"story": ["Joe was going to the beach.", "As he was getting ready he saw that his dog chewed up his sandals.", "Joe was angry.", "Joe got ready and went to the store to get sandals.", "Joe went to the beach and had a good time."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Joe and i tried to learn to ride a unicycle, today.", "I was doing pretty well as long as i could keep a hand on the fence.", "Joe was doing a lot better, though.", "By the end of the day, he could ride for a whole ten feet.", "Someday, we'll be good enough to do a show."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Marie decided to make chicken for dinner.", "She defrosted the chicken and then cut the pieces in half.", "She rolled the chicken in butter, corn flakes and cheese.", "She put them in the pan and baked them for an hour.", "Once the chicken was done, her family sat down to eat."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Brent was a lonely child.", "He had no brother or sister to play with.", "One day he met a friend at school.", "Brent's friend was named john.", "Brent is no longer lonely."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Bill was an astronaut.", "He went to space on a rocket.", "As he floated around, he saw that the radio was broken.", "He had to fix it quickly so he could communicate.", "He fixed it in 1 hour and could communicate with nasa."], "cause_idx": [2], "res_idx": 4}
{"story": ["Emily loved drinking grape juice.", "One day she was drinking it near her bed.", "She spilled the juice.", "She was upset.", "She cleaned it up and that made her happy."], "cause_idx": [2], "res_idx": 4}
{"story": ["John is traveling to san diego next week.", "He has never been to california before.", "However, he forgot to pack until the last minute.", "So he's been frantically getting everything together.", "He won't make that mistake."], "cause_idx": [], "res_idx": 4}
{"story": ["Tom had a long work week ahead of him.", "He was sad.", "He did not want to work.", "He decided to buy an mp3 player.", "Now he had music to make him feel better throughout the week."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sarah bought a flower pot at a yard sale for one dollar.", "She took it home and cleaned it up with a fresh coat of paint.", "Sarah decided to go to the flower shop and buy a plant for it.", "She bought a rose bush and planted it in the pot.", "Two weeks later it had little pink roses blooming on it."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Anna saw a quarter on the ground.", "She bent to pick it up.", "But she couldn't.", "The quarter was glued to the ground!.", "Someone had placed it there as a trick."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lee wanted to compete in a race.", "She started running on her own.", "Soon she was faster and faster.", "Then she entered a race.", "Lee came in third place!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Jackson needs to find something to cook for guests arriving today.", "He looks in his cupboard and sees that he has ingredients for soup.", "Jackson cooks a terrific chicken noodle soup for his guests.", "All of his guests love jackson's soup.", "He is very happy he found something to cook for them."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Arnold's car had broken down.", "He brought it to the mechanic.", "The mechanic said he needed a new engine.", "Arnold decided it wasn't worth repairing.", "He began looking for a used vehicle."], "cause_idx": [3], "res_idx": 4}
{"story": ["My grandparents lived in alabama.", "We used to travel there every summer.", "We would eat from their garden, and use plants for medicine.", "I learned a lot about the country from being there.", "I miss traveling there, and miss my grands."], "cause_idx": [0, 1], "res_idx": 4}
{"story": ["There was a huge storm the other day.", "We went down to the ocean to watch the waves.", "They reached almost 15 feet.", "It was amazing to watch.", "I took a few pictures of them."], "cause_idx": [3], "res_idx": 4}
{"story": ["Ollie does not plan to go to school today.", "When he leaves home after breakfast, he walks towards the bus stop.", "He continues past the bus stop and goes to the arcade.", "As it turns out, the arcade isn't open at 9am.", "Ollie goes to school."], "cause_idx": [2], "res_idx": 4}
{"story": ["William was out with his girlfriend.", "It was a hot day, and they wanted ice cream.", "They stopped by a local ice cream parlor.", "The pair bought a couple scoops of ice cream.", "They enjoyed the treat and continued walking together."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sam wanted to fly a kite.", "He ordered one off of ebay.", "He got it in the mail 2 days later.", "He waited for a windy day to fly his kite.", "His kite flew away and got stuck in a tree."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tom left his car at his mom's house in the backyard.", "He left it there for years.", "It became filled with bees.", "Tom saw his car and got rid of it.", "Tom just bought a new car."], "cause_idx": [3], "res_idx": 4}
{"story": ["Asher loves to eat pancakes.", "He eats them piled with syrup.", "He puts whipped cream on them too.", "For a 4 year old, he can eat five pancakes in one sitting.", "He loves them for every meal."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["It was summer and bugs were all around.", "But ben hated bugs.", "He did not want them in his room.", "He kept bug spray by his bed.", "He killed every bug he saw in his room!."], "cause_idx": [3], "res_idx": 4}
{"story": ["My friends and i wanted to go to a water park.", "First we loaded up the car with snacks for the trip.", "Then we drove 3 hours to the water park.", "When we arrived, we went on every single ride.", "We had a great time, and i hope we go back soon."], "cause_idx": [2], "res_idx": 4}
{"story": ["One halloween, gray was playing a game to find candy.", "He looked all through a pile of hay to find hidden pieces of candy.", "When he found the candy, he put it in his bucket.", "Gray thought it was more fun to find the candy than to keep it.", "At the end of the game, gray had no candy because he would put it back."], "cause_idx": [3], "res_idx": 4}
{"story": ["Cory had his first track meet today.", "Cory had only been on the track team for a few weeks.", "He ran laps every day with his friends.", "He still wasn't sure how his performance would compare.", "Cory did much better than he expected."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Brad wanted to learn spanish.", "He decided to take a spanish class.", "He practiced the language diligently every day.", "By the end of the class, he was speaking spanish fluently.", "Brad was proud that he accomplished his goal."], "cause_idx": [], "res_idx": 4}
{"story": ["Ethan turned the oven on.", "He put a potato in the oven.", "It cooked for an hour.", "He pulled it out.", "He ate it for dinner."], "cause_idx": [2], "res_idx": 4}
{"story": ["Ben had a new kite.", "Sam had a new kite as well.", "Sam's kite flew and ben's didn't.", "Sam felt bad.", "Sam gave his kite to ben and they were both happy."], "cause_idx": [2], "res_idx": 4}
{"story": ["I let my dog out in the backyard.", "A few hours later, i went to check on him.", "I couldn't find my dog anywhere.", "I told my husband he was lost.", "He laughed at me and told me he already let the dog in."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Annie had a few pet fish.", "She bought a new fish food for them.", "Whenever she sprinkled it in, the fish went crazy.", "Annie liked feeding her little pets.", "She fed them one more time before bed."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Yolanda wanted to get a haircut.", "She set up an appointment with her favorite hairdresser.", "She decided to cut her hair short.", "Her hairdresser spent 2 hours cutting her hair.", "Yolanda loves how much lighter her head feels."], "cause_idx": [2], "res_idx": 4}
{"story": ["The boy cried.", "A woman saw the boy crying.", "She wanted to help.", "The boy did not want her help.", "The boy's mother came running over."], "cause_idx": [3], "res_idx": 4}
{"story": ["I sat on the living room with a twinkie for a snack.", "The sound of the wrapper made my cat curious.", "My cat stretched and sniffed at my twinkie.", "Then to my surprise he ate my twinkie.", "Now i have to hide from my cat to eat a twinkie."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Alice loved to do arts and crafts.", "She liked the glitter and put it on everything.", "She made a hat to wear and put glitter all over it.", "But she didn't use that much glue.", "And the glitter got everywhere in the house."], "cause_idx": [2], "res_idx": 4}
{"story": ["Zaiden woke up ready to play cars.", "He did not want to play by himself.", "He asked his mom to play cars with him.", "She agreed.", "Caden and his mom played cars all morning."], "cause_idx": [2], "res_idx": 4}
{"story": ["Anna went outside to play tennis.", "She was having fun until the ball hit her in the face.", "Anna fell down and howled in pain!.", "She had to lay down with ice on her face that night.", "Even still, she woke with a puffy black eye the next morning."], "cause_idx": [2], "res_idx": 4}
{"story": ["Alexis had a gymnastics meet.", "A lot of people were coming to watch and she wanted to be the best.", "Her first event was the floor and she got a perfect ten.", "Next she performed on the bars and got a 9 point 9.", "She won two gold medals."], "cause_idx": [2], "res_idx": 4}
{"story": ["There was a house that was said to be haunted.", "The owners tried hard to sell it but no one wanted it.", "They hired a priest to get rid of the evil spirits.", "The priest came to the house and walked around.", "He said there never was any ghosts there in the first place."], "cause_idx": [0], "res_idx": 4}
{"story": ["My sister in law was excited this week.", "She found two complete sets of time life books in her attic.", "I researched amazon and said she could make $200.", "When she weighed the books she found out they were too heavy.", "She decided to donate the books to people who could pick them up."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lily loved chicken nuggets.", "She decided to make some for herself.", "She got all the ingredients and set to work.", "When they were done, she was pleased with her work.", "However, when she tasted them, she realized she still needed practice."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lucy had just moved to a new school.", "She was upset about the change and not into the school.", "On her birthday, her mom got her some school spirit wear.", "Lucy was unhappy about the gift and stormed off.", "Her mom took the gift back and decided not to press the issue."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Tito wanted a snake as a pet.", "He finally convinced his wife to allow it.", "He went to the pet store.", "He brought home his new pet snake and put it in his room.", "Tito was so happy with his pet!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Kate's school had a contest.", "Whoever could earn the most box tops would win a prize.", "Kate spent all month finding as many box tops as possible.", "On the last day of the contest, she turned in her box tops.", "She ended up winning."], "cause_idx": [2], "res_idx": 4}
{"story": ["His cousins were coming later too his house.", "So his mom made him clean all morning.", "Get groceries in the afternoon.", "Get ready in the evening.", "His cousins came to his house."], "cause_idx": [0], "res_idx": 4}
{"story": ["Mom makes me cookies.", "Mom got down the flour.", "Next a big bowl and sugar.", "Mom said i could help.", "The cookies were awesome."], "cause_idx": [0], "res_idx": 4}
{"story": ["Jerry had a important meeting in an hour.", "He rushed to the store to get some food first.", "He was eating his sandwich on the way to the meeting.", "He spilled mustard on his favorite tie!.", "So, he took off his tie, and attended the meeting."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Ted is the first of his friends to own a car.", "All of his friends want rides to school everyday.", "Ted only has room in his car for six people.", "Ted told his friends whoever is willing to pay for gas can get a ride.", "Ted has made a nice little side business while driving to school."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Joey fell off the jungle gym during recess.", "The nurse called his mom to pick joey up.", "Joey's mom brought him to the doctor.", "The doctor had to put a cast on joey's broken wrist.", "The next day, joey let his classmates sign his cast."], "cause_idx": [3], "res_idx": 4}
{"story": ["I had to tell the lifeguard my name.", "He had pulled me out of the water.", "He had to jump in and get me.", "I liked to go to the deep end of the pool.", "It was a wave pool."], "cause_idx": [], "res_idx": 4}
{"story": ["Dan and his daughter went to the supermarket.", "As they reached the checkout, dan's daughter was asking for candy.", "Dan told his daughter that she could not get any candy.", "Dan's daughter immediately threw a tantrum right there in the store.", "Dan was so embarrassed with the behavior of his daughter."], "cause_idx": [3], "res_idx": 4}
{"story": ["I noticed that my carpet was starting to crunch under my feet.", "I decided that it was time to clean it.", "I got my steam cleaner and got it ready.", "I spent the day cleaning the carpets.", "I walked across the clean fluffy carpets in my home."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Walt wanted some ice cream, so he went to the store to get some.", "When he got to the store, he saw the best invention he had ever seen.", "It was a ball that would make ice cream when you shook it!.", "Walt put all his ingredients into the ice cream ball and shook it.", "When he opened up the ball, he ate his delicious ice cream."], "cause_idx": [3], "res_idx": 4}
{"story": ["Allie went to buy candy.", "They were very sour.", "Allie had to spit it out.", "She couldn't stomach it.", "She never wanted to buy it again."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Sam made a bet with his mom.", "She bet he couldn't eat veggies at every meal for a week.", "He accepted.", "But he could not stand eating all those veggies.", "His mom won the bet!."], "cause_idx": [3], "res_idx": 4}
{"story": ["Phil was skateboarding with his friends.", "He was trying to jump over a bench.", "When he landed on his skateboard, it broke.", "Phil went to the store and bought a new skateboard.", "He skated with his friends the rest of the day."], "cause_idx": [0], "res_idx": 4}
{"story": ["Tim just broke his leg last week while running track.", "He will be out for three months at the least.", "The coach is upset because tim cannot run for his team anymore.", "Tim's doctor said he can still exercise his upper body only.", "Tim decided to do the shot put for the track team instead of running."], "cause_idx": [0], "res_idx": 4}
{"story": ["Freddie was about to have his 80th birthday.", "Freddie wanted to do something that would make him feel young.", "Freddie decided that he would go sky diving.", "After passing all the tests, freddie was cleared to go skydiving.", "Freddie was excited to go sky diving, as it made him feel young."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["My aunt was on the way home from work tuesday.", "She had to take the bus because her car is broken.", "It was fairly full and she had nowhere to sit.", "A stranger offered her his seat.", "She took it and thanked him kindly."], "cause_idx": [3], "res_idx": 4}
{"story": ["Mister smith's students would not stop talking.", "So mister smith decided he was going to give them a pop quiz.", "He told the class to each pull out a piece of notebook paper.", "He read the questions out loud as they scribbled down their answers.", "He then collected the papers to grade that night."], "cause_idx": [], "res_idx": 4}
{"story": ["We like to climb stairs.", "We climb them everyday.", "Sometimes we fall.", "Today we tried to climb a lot of stairs.", "We made it all the way to the top."], "cause_idx": [3], "res_idx": 4}
{"story": ["Sally gets a new bike for her birthday.", "She is sad though because she does not know how to ride it.", "Her father teaches her how to ride it.", "After a couple weeks of practice, sally can ride her bike on her own.", "She now rides her bike everywhere she goes."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["I went shopping for some food yesterday.", "We had very little in the house.", "I had a very long list of things to buy.", "I think i remembered to get everything i needed.", "It cost me a lot of money."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Sally had work later tonight.", "She got into her car to drive to work.", "Her car wouldn't start.", "Sarah called her friend joe for a ride.", "Joe came 5 minutes later and was able to give sarah a ride to work."], "cause_idx": [2], "res_idx": 4}
{"story": ["Billy decided he wanted to make a robot.", "He worked for many months to get it just right.", "Once finished, he wanted to show it off.", "Billy took the robot to school to show his friends and teachers.", "When he turned the robot on, it exploded in flames."], "cause_idx": [1], "res_idx": 4}
{"story": ["I decided to make breakfast for my mom and dad this morning.", "I made my favorite cereal as soon as i got up for my family.", "My mom and dad slept in and the cereal sat for an hour.", "When they got up they were very happy to see they had breakfast ready.", "They told me next time they will make breakfast and i could sleep in."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Lucy was sitting on the porch at her grandparents.", "She had no friends, and nothing to do.", "She went for a walk down the block.", "She picked up a stick and played drums on a fence.", "She decided she had better stop when the owner opened their door."], "cause_idx": [3], "res_idx": 4}
{"story": ["Jerry got lost during the walk to his last period.", "He didn't know where to find the class and ended up moving in a circle.", "Someone was kind enough to show where he needed to go.", "Since the bell is going to ring in several seconds, he speed walked.", "However, he was late to the class."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["The man put on his watch.", "His watch was not running.", "He took his watch off.", "He shook the watch.", "The watch started running again."], "cause_idx": [3], "res_idx": 4}
{"story": ["Alice's class took a field trip to a farm.", "Their teacher promised they would see many animals.", "Alice saw a big cow.", "She asked if she could pet the cow.", "The cow was very soft."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["It was hot that day.", "The day that ed went to the market.", "He was sweating all down his face.", "The salty sweat stung his eyes.", "Ed ran back home in pain and didn't go to the market that day."], "cause_idx": [3], "res_idx": 4}
{"story": ["The traffic was backed up tonight.", "There was an accident on the highway.", "It caused a traffic jam in the city.", "I was late to practice.", "I need to leave earlier."], "cause_idx": [0], "res_idx": 4}
{"story": ["It had been raining all evening.", "Tom and robert called for a taxi to get back home.", "They waited nearly one hour for a taxi to arrive.", "No taxi arrived, and the line for the taxi was quite long.", "Tom and robert decided to walk the five miles home."], "cause_idx": [3], "res_idx": 4}
{"story": ["I went to the playground when i was young.", "I used to slide down the poles all day.", "I would slide really fast.", "I broke my arm one slide.", "I had to get a bright green cast."], "cause_idx": [], "res_idx": 4}
{"story": ["Ivy wanted to date jason, but her parents said no.", "They thought he was a bad guy.", "Then ivy set up a meeting between her parents and jason.", "They decided that jason was charming and polite and after all.", "They told ivy that she was allowed to date him after all!."], "cause_idx": [2], "res_idx": 4}
{"story": ["Jacob was at the library.", "He was reading a book that he really wanted.", "He decided to steal the book.", "When no one was looking, he tore the plastic off.", "Then, he stuffed it in his bag and quickly left."], "cause_idx": [2], "res_idx": 4}
{"story": ["Ali is new at school.", "All the kids make fun of her because she wears a hijab.", "One day on the playground other kids take the hijab off her head.", "Lucy stands up for her and gets the hijab back.", "Lucy and ali become friends that day."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Jonah's son had been playing with his building blocks.", "His son had left the blocks all over the room.", "Jonah stepped on a block.", "It hurt his foot.", "Jonah threw all the blocks away."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Anne liked to bake.", "She bought a new pie pan for baking pies.", "She planned on using it a lot this fall.", "When it was time to test it out, she couldn't find it.", "Her son had taken it and used it in the sandbox!."], "cause_idx": [2], "res_idx": 4}
{"story": ["Sara went to the supermarket to buy maple syrup.", "She found her favorite brand but it was on a high shelf.", "There was no one to help her so she picked a different brand.", "When sara got home she sampled the new syrup.", "She felt that this tasted even better than her regular brand."], "cause_idx": [3], "res_idx": 4}
{"story": ["Tony was trying to open a pickle jar.", "He couldn't get the lid off.", "He decided to run it under warm water.", "Soon, he was able to get the lid off.", "Then, he ate some pickles."], "cause_idx": [3], "res_idx": 4}
{"story": ["Lisa had just finished up shopping.", "She was walking back to her car.", "She noticed that it was very hot outside.", "When she tried to sit in the car, she burnt her hand on the seat belt.", "She had to wrap it in a coat before she could use it."], "cause_idx": [3], "res_idx": 4}
{"story": ["Clara was babysitting a girl.", "The girl had gone to sleep and clara was bored.", "She decided to clean the house.", "When the owner got home, she was really pleased.", "She paid clara and clara noticed an extra tip."], "cause_idx": [3], "res_idx": 4}
{"story": ["Billy decided to collect insects.", "He got a butterfly net and some jars.", "He spent the whole day collecting insects outside.", "He filled all his jars with different insects.", "Billy decided that he enjoyed his new hobby."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Fran has five friends.", "One day, her friends told her they didn't like her.", "They forced her to make new friends.", "After a week, fran had found a new friend.", "She is much happier with her one new friend."], "cause_idx": [3], "res_idx": 4}
{"story": ["Nick children had a messy room.", "They left their toys all over the place.", "Nick bought a huge toy box to put the toys in.", "His kids put the toys in the toy box.", "Now their rooms are clean."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Hazel lived alone at the end of pershing street.", "Her children had moved back east so she didn't have family close by.", "There was a stray dog who lived under some bushes on hazel's land.", "Hazel never let the dog inside her house but she loved him anyway.", "Every morning she would sit on her porch and feed that dog by hand."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Joan wanted a to buy her first car.", "Her parents told her she would have to pay for it herself.", "Joan picked out a car but it cost way more than her allowance.", "Joan got a job and saved for months.", "Joan went and bought her new car with her own money."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Dan's wife jane was on a health kick.", "Dan decided he was going to eat a burger.", "He decided to eat car in the car in the garage.", "His son dave caught him eating the burger.", "Dan gave him half the burger to keep quiet."], "cause_idx": [3], "res_idx": 4}
{"story": ["My parents came from china.", "My dad did not know about halloween.", "One day some kids knocked on his door for candy.", "He yelled at them and chased them away.", "He bought candy year's later when he learned about halloween."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Mila wanted a pet.", "She went to the pet store to look for one.", "At the pet store mila saw a puppy.", "Mila loved the puppy and took it home.", "Mila was happy she found her new pet."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Jenn wanted to throw a surprise party for kate.", "She secretly sent out invitations to kate's friends.", "She ordered balloons and food to be delivered on the special day.", "All of kate's friends showed up early and hid until kate arrived.", "When kate walked through the door, everyone shouted and cheered."], "cause_idx": [3], "res_idx": 4}
{"story": ["We went to a store far away from home.", "They were having a big fireworks sale.", "We bought tons of fireworks.", "We spent over $100 on them.", "We took them home to light off."], "cause_idx": [], "res_idx": 4}
{"story": ["Sarah borrowed her mom's car.", "She used it to get some things done outside of the house.", "She lost track of time.", "She was very late returning the car to her mom.", "Her mom was very upset with her."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["I woke up while shivering from the cold weather.", "It was hard to focus in class today since i was freezing.", "I tried to write however, my hands were too cold.", "As soon as i got home, i decided to take a hot shower.", "My body was warm afterwards."], "cause_idx": [3], "res_idx": 4}
{"story": ["Juan was having a terrible day at work.", "Customers were complaining about the lack of open registers.", "But there was nothing he could do about it.", "During break time, juan yelled at his boss.", "He was immediately fired."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Jim was talking to this lady he met at the bar.", "Some man stood in front of them and was trying to steal her.", "Jim got up and argued with him.", "The man decided to throw a punch at jim.", "They ended up fighting."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Ben liked to play around with animals.", "He wasn't the nicest of kids either.", "He was playing with a dog he thought was well behaved.", "Just like him, it was not well behaved.", "The dog bit ben because he was being rough with him."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Johnny was a good man to anita, but she didn't like him.", "They argued when she tried to break up with him.", "She called the police, but johnny didn't leave.", "Anita told johnny he was a liar and a cheater in front of the cops.", "Johnny punched annita in her nose right in front of the cops."], "cause_idx": [3], "res_idx": 4}
{"story": ["Clark was walking down the sidewalk.", "He saw a man fall to the ground.", "The man was holding his chest.", "Clark called 911.", "Clark's quick actions saved the man's life."], "cause_idx": [3], "res_idx": 4}
{"story": ["Joey was in a rush to leave the house for work.", "He rushed down the steps, and fell to the bottom.", "Joey's leg was broken in three places.", "He needed to call an ambulance.", "Joey is going to miss plenty of work while in the hospital."], "cause_idx": [2], "res_idx": 4}
{"story": ["My mom read that raw milk was a healthy food.", "She found a farm that sold raw milk.", "We have been drinking it for 12 years.", "Our cat got sick and we fed it some raw milk.", "It helped him get better without going to the vet!."], "cause_idx": [], "res_idx": 4}
{"story": ["I have a new favorite show on television.", "The show is on every weekend and i never miss it.", "This week i have to be out of town for my job.", "I asked jerry if he could record the show for me.", "He said he will and i can't wait to get back from my work function."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Chloe wanted a sandwich.", "She got the bread out.", "She put mayo on the bread.", "She put on the other things.", "She ate the sandwich."], "cause_idx": [0], "res_idx": 4}
{"story": ["My mom and i love the show breaking bad.", "We decided to visit albuquerque to see some of the sites from the show.", "Our first stop was the laundry where walt worked.", "When we got out of the car the cops came.", "The cops told us a man was on the loose and we should be careful."], "cause_idx": [3], "res_idx": 4}
{"story": ["The cow fell asleep.", "A man went up to the cow.", "He pushed the cow.", "The cow fell over.", "The cow died."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Dina didn't like her teacher.", "She was talking about her teacher in the hallway with her friend.", "Dina's teacher was standing in the hallway.", "She heard dina talking.", "Dina got in trouble for talking about the teacher."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Tina had a lot of homework.", "Instead of doing the homework, tina watched television.", "After a while, tina woke up and it was very late.", "Tina has to rush through her homework.", "The teacher gave tina a bad grade for poor work on the homework."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Berry was cooking a pie.", "She got a phone call from an old friend.", "Betty was enjoying her time on the phone.", "Betty had forgot about her pie in the oven.", "By the time betty was done with the call, the pie was burned."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["I just moved into a new apartment.", "Now i need to put up all of my wall decorations.", "I have nails and screws, but no tools.", "I am using a roll of quarters as a hammer.", "It is not working too well, and i will have to seek tools."], "cause_idx": [3], "res_idx": 4}
{"story": ["Jordyn played in a soccer game today.", "Both teams were very good and it was a tough game.", "Jordyn scored the winning goal and was very proud.", "Jordyn's mom ran up to her and gave her a big hug.", "Jordyn went out for ice cream after the big win."], "cause_idx": [3], "res_idx": 4}
{"story": ["I awoke very tired.", "I got dressed and grabbed my wallet.", "I walked over to the coffee shop and ordered a coffee.", "I sat down and drank my coffee.", "After i was done, i felt much better."], "cause_idx": [3], "res_idx": 4}
{"story": ["Morgan wanted to make a cat bed for her cat.", "She got all the fabric she needed and sat down to work.", "She sewed for a full day to make the best cat bed she could.", "Then, she gave it to her cat to see if he would like it.", "The cat slept in a box instead, because cats are like that."], "cause_idx": [3], "res_idx": 4}
{"story": ["A man in alabama wanted to see what life was like up north.", "He got in his car and went to the highway.", "Once he reached new england he did not stop.", "The man drove all the way to canada.", "Once he crossed the border he got out and smelled the air."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Nancy had been unhappy in her marriage for many year's.", "She knew it was time for a change, but she was afraid of being alone.", "Finally nancy decided to divorce her husband.", "It was hard on both of them, but in the end it was the right thing.", "Now alone, nancy is happy that she is no longer with her ex husband."], "cause_idx": [0, 2], "res_idx": 4}
{"story": ["Yesterday was lauren's birthday.", "Her mother decided to surprise her with her favorite cake.", "Lauren loves lemon cake.", "Lauren's mother even decorated the cake with candles.", "She loved the cake and ate 2 pieces after blowing out the candles."], "cause_idx": [1, 3], "res_idx": 4}
{"story": ["Today my family went to the beach.", "We splashed around in the water.", "We built sand castles.", "Dad brought a picnic and we ate sandwiches on the beach.", "We were so tired at the end of the day i fell asleep in the car."], "cause_idx": [], "res_idx": 4}
{"story": ["For the third night in a row, young jeremy had fallen out of his bed.", "His mom was really nervous he was going to be seriously hurt.", "Her friend told her to use a foam pool noodle to keep him safe.", "She put the noodle under the fitted sheet along the edge of the bed.", "Surprisingly, jeremy didn't fall out of the bed again."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Tim got a bat for his birthday.", "It was very heavy.", "He was mad that he couldn't lift it.", "He worked out everyday for a month.", "After that he could lift it easily."], "cause_idx": [3], "res_idx": 4}
{"story": ["Jake's favorite sport was basketball.", "He played on the school team in the 4th, 5th, and 6th grade.", "Yesterday, he looked through his dad's old basketball trading cards.", "Jake was surprised when his dad's name was on the card.", "Jake's dad had his own basketball card when he was a professional."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Today i went to the library.", "They had so many books.", "But they also had movies and magazines too.", "I checked out a book and a movie.", "Now i have to go back to return them."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Bob was watching a cooking show where they were making steak.", "Bob got hungry.", "Bob went went to the store to get steak and mushrooms.", "When bob got home bob cooked the steak and mushrooms with butter.", "After bob had eaten his delicious bob felt satiated."], "cause_idx": [3], "res_idx": 4}
{"story": ["One afternoon, i let my dog, pandy, outside to play.", "Pandy was enjoying herself until she noticed a rabbit nearby.", "The rabbit saw pandy and started to hop away as fast as it could.", "Pandy chased the rabbit for a long time, but finally had to stop.", "She returned to the house, tired and ready for a long nap."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["Jane never smiled.", "She had nothing to smile about.", "Everyone thought she would never smile.", "One day tim tripped and fell.", "Jane ended up smiling really hard."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Ian decided to grow his own vegetables in his backyard.", "He thought it would save him money.", "But he got tired of watering of them.", "It turned out to be a lot of work.", "Ian felt like a full time farmer."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Greg picked up his friend.", "They went off road trucking.", "The truck got stuck.", "Greg couldn't get it out himself.", "Greg got it out with his friend'."], "cause_idx": [2, 3], "res_idx": 4}
{"story": ["One day sasha went to the brooklyn bridge.", "She walked along it for a while.", "She loved the view of the water and the city.", "Then she went back to her hotel.", "She had a great day."], "cause_idx": [], "res_idx": 4}
{"story": ["Hallie was having a birthday party at her house.", "She could not wait to blow out the candles on her cake.", "Before, the cake, hallie played games with her family and friends.", "Hallie's mother brought out the cake.", "Hallie finally got to blow out the candles on her birthday cake."], "cause_idx": [3], "res_idx": 4}
{"story": ["My uncle brought me several pounds of deer meat.", "He had made some of the meat into summer sausages.", "I didn't like to eat meat, but i had to admit i loved deer.", "I ate a large piece with my dinner that night.", "We spent the evening filling the deep freezer to the top."], "cause_idx": [2], "res_idx": 4}
{"story": ["Kandy's class was having a candy draw.", "Whomever was picked first could pick some candy.", "Kandy was picked first.", "She walked to the front of the room.", "She picked a lollipop."], "cause_idx": [2], "res_idx": 4}
{"story": ["Samantha had a lot of chores to do.", "She didn't know which chore to do first!.", "Samantha decided to make a to-do list to get herself organized.", "Samantha made a to-do list and started on her chores.", "Samantha was able to finish all of her chores!."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Fred comes home after work unsure about what to eat.", "He checks his cabinet and realizes he has spaghetti.", "Fred cooks the spaghetti eats it for dinner.", "After cooking he leaves the dirty dishes in the sink.", "He is happy that he didn't have to leave the house to get food."], "cause_idx": [2], "res_idx": 4}
{"story": ["Tim and jessica went outside to play a game of hide and seek.", "Jessica found a great place to hide in a cave by a tree.", "After ten minutes, she heard leaves moving and knew tim was near.", "She didn't move an inch, and all of a sudden, tim found the cave!.", "Then tim went to hide and jessica went to seek."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Alicia was paying solitaire.", "She really wanted to win.", "Finally after twenty minutes, she won.", "Alicia decided to play again.", "This time she won in five minutes."], "cause_idx": [3], "res_idx": 4}
{"story": ["Billy has asked santa for a sled for christmas.", "So he was really hoping it would be a white christmas.", "The weatherman was calling for snow when he went to bed.", "The next morning he woke up to snow on the ground.", "He had gotten his sled, too."], "cause_idx": [0, 3], "res_idx": 4}
{"story": ["Andrea's dad asked her to get firewood.", "She went downstairs and then outside.", "In the back yard, there was a pile of wood.", "She grabbed a few logs.", "Then, she brought them inside."], "cause_idx": [3], "res_idx": 4}
{"story": ["Yvette made coffee for her guests.", "She brought the tray on the coffee table.", "But the first guest complained that he didn't like her coffee.", "The second complained that the milk was too fat.", "Yvette went back in the kitchen, crying her eyes out."], "cause_idx": [0, 2, 3], "res_idx": 4}
{"story": ["Dan was walking in his farm when he felt some pinch on his leg.", "He then saw a snake nearby and thought it was a snake bite.", "Dan got scared and rushed to the nearest hospital.", "The doctor said it was just an insect bite and not a snake.", "Dan was relieved and happy to hear that from the doctor."], "cause_idx": [0, 3], "res_idx": 4}
